00_nucleo/diagnosticos/p1339-mutant-closed-state-style-harness-r3.diff
diff --git a/00_nucleo/diagnosticos/p1339-mutant-closed-state-style-harness-r2.rs b/00_nucleo/diagnosticos/p1339-mutant-closed-state-style-harness-r3.rs
index 9faadd40a..8ae94ff0a 100644
--- a/00_nucleo/diagnosticos/p1339-mutant-closed-state-style-harness-r2.rs
+++ b/00_nucleo/diagnosticos/p1339-mutant-closed-state-style-harness-r3.rs
@@ -1,5 +1,5 @@
 // Batch-one direct same-EvalContext/same-Engine input adapter; no pipeline loop.
-// Descendant of the frozen API harness. Successor r2: instrumental E0499 fix only.
+// Descendant of the frozen API harness. Successor r3: associated-call correction for r2 E0599 only.
 // Same logical Engine resources; short-lived reborrow views, no runtime credit.
 use super::*;
 use crate::entities::style_chain::StyleDelta;
@@ -167,7 +167,7 @@ fn run_style_case(
         // Engine is a short-lived borrow view; all logical resources and ctx
         // remain the same. Reborrow tracked sinks to bound each view's lifetime.
         let mut current_file = {
-            let mut setup_tracked = product_tracked.reborrow_mut();
+            let mut setup_tracked = comemo::TrackedMut::reborrow_mut(&mut product_tracked);
             let mut engine = Engine {
                 world: &world,
                 font_metrics: &metrics,
@@ -191,9 +191,9 @@ fn run_style_case(
                 validation_phase = true;
             }
             let mut operation_tracked = if validation_phase {
-                validation_tracked.reborrow_mut()
+                comemo::TrackedMut::reborrow_mut(&mut validation_tracked)
             } else {
-                product_tracked.reborrow_mut()
+                comemo::TrackedMut::reborrow_mut(&mut product_tracked)
             };
             let mut engine = Engine {
                 world: &world,
@@ -262,9 +262,9 @@ fn run_style_case(
             current_file = engine.current_file;
         }
         let mut finish_tracked = if validation_phase {
-            validation_tracked.reborrow_mut()
+            comemo::TrackedMut::reborrow_mut(&mut validation_tracked)
         } else {
-            product_tracked.reborrow_mut()
+            comemo::TrackedMut::reborrow_mut(&mut product_tracked)
         };
         let engine = Engine {
             world: &world,
